# 16. First Steps with Pandas Series

In [778]:
import pandas as pd

In [779]:
titanic = pd.read_csv("titanic.csv")

- when selecting only one colun with one row data usually get a pandas series

In [780]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [781]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [782]:
titanic["age"] #returns series (one dimensional labeled array) (array with 891 length)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [783]:
type(titanic["age"])

pandas.core.series.Series

In [784]:
age = titanic["age"]

In [785]:
age.dtype #attribute

dtype('float64')

In [786]:
age.shape

(891,)

In [787]:
len(age)

891

In [788]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [789]:
#age.info() #returns error , because info method only available on pandas dataframe

In [790]:
age.to_frame().info() #convert series to dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

# 17. Analyzing Numerical Series with unique(), nunique() and value_counts()

## analyzing numerical series

In [791]:
age.describe() #summary statistics on nummerical columns

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [792]:
age.count() #returns value with non missing value

714

In [793]:
age.size #returns all element including with missing values

891

In [794]:
len(age)

891

In [795]:
age.sum()

21205.17

In [796]:
age.sum(skipna = True) #sum(age) #because sum method can't handle missing value , see info with shift+tab

21205.17

In [797]:
age.mean()

29.69911764705882

In [798]:
age.median()

28.0

In [799]:
age.std()

14.526497332334042

In [800]:
age.min()

0.42

In [801]:
age.max()

80.0

In [802]:
age.unique() #nan values are included

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [803]:
len(age.unique())

89

In [804]:
age.nunique() #excludes missing values , have (dropna= ) parameter

88

In [805]:
age.value_counts()

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: age, Length: 88, dtype: int64

In [806]:
age.value_counts(sort = True) #sort from high frequency to low , if false return in order of appearance

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: age, Length: 88, dtype: int64

In [807]:
age.value_counts(dropna=False) #dropna default true

NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
0.42       1
34.50      1
66.00      1
14.50      1
0.92       1
Name: age, Length: 89, dtype: int64

In [808]:
age.value_counts(ascending = True) #from low frequencies to high

0.67      1
14.50     1
36.50     1
74.00     1
24.50     1
         ..
19.00    25
30.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [809]:
age.value_counts(sort = True,dropna=True,ascending = False, normalize = False)

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: age, Length: 88, dtype: int64

In [810]:
age.value_counts(sort = True,dropna=False,ascending = False, normalize = True) #normalize calculate relative frequencies

NaN      0.198653
24.00    0.033670
22.00    0.030303
18.00    0.029181
28.00    0.028058
           ...
0.42     0.001122
34.50    0.001122
66.00    0.001122
14.50    0.001122
0.92     0.001122
Name: age, Length: 89, dtype: float64

In [811]:
30/age.size #30/age.count() #count return with no missing values

0.03367003367003367

In [812]:
age.value_counts(sort = True,dropna=True,ascending = False, normalize = True, bins = 5) #bins equal range , equal width , 
#normalize get relative frequencies

(16.336, 32.252]    0.388328
(32.252, 48.168]    0.210999
(0.339, 16.336]     0.112233
(48.168, 64.084]    0.077441
(64.084, 80.0]      0.012346
Name: age, dtype: float64

In [813]:
age.value_counts(sort = True,dropna=False,ascending = False, normalize = True).sum()*100 #method chaining

99.99999999999999

# 18. Analyzing non-numerical Series with unique(), nunique(), value_counts()

## analyzing non numerical series

In [814]:
summer = pd.read_csv("summer.csv")

In [815]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [816]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [817]:
athlete = summer["Athlete"]

In [818]:
athlete.head()

0         HAJOS, Alfred
1      HERSCHMANN, Otto
2     DRIVAS, Dimitrios
3    MALOKINIS, Ioannis
4    CHASAPIS, Spiridon
Name: Athlete, dtype: object

In [819]:
athlete.tail()

31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, dtype: object

In [820]:
type(athlete)

pandas.core.series.Series

In [821]:
athlete.dtype #returns object

dtype('O')

In [822]:
athlete.shape #returns 1 dimensional array

(31165,)

In [823]:
athlete.describe()

count               31165
unique              22762
top       PHELPS, Michael
freq                   22
Name: Athlete, dtype: object

In [824]:
athlete.size

31165

In [825]:
athlete.count() #same as size because doesn't have missing values

31165

In [826]:
athlete.min()

'AABYE, Edgar'

In [827]:
athlete.unique()

array(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios', ...,
       'TOTROV, Rustam', 'ALEKSANYAN, Artur', 'LIDBERG, Jimmy'],
      dtype=object)

In [828]:
len(athlete.unique())

22762

In [829]:
athlete.nunique()

22762

In [831]:
athlete.value_counts()

PHELPS, Michael                  22
LATYNINA, Larisa                 18
ANDRIANOV, Nikolay               15
SHAKHLIN, Boris                  13
MANGIAROTTI, Edoardo             13
                                 ..
SOUTHERN, Arthur George Heron     1
AZEVEDO EVORA, Affonso            1
FERRIS, Samuel                    1
KASPUTIS, Arturas                 1
STETSENKO, Tatiana                1
Name: Athlete, Length: 22762, dtype: int64

In [832]:
athlete.value_counts(sort = True, ascending = True)

TERESHCHUK-ANTIPOVA, Tetiana     1
LAY, Jeffrey                     1
VALLEREY JR., Georges            1
SAVITSKAYA, Galina               1
BEYER, Uwe                       1
                                ..
ONO, Takashi                    13
MANGIAROTTI, Edoardo            13
ANDRIANOV, Nikolay              15
LATYNINA, Larisa                18
PHELPS, Michael                 22
Name: Athlete, Length: 22762, dtype: int64

In [835]:
athlete.value_counts(sort = True, ascending = False, normalize = True).head()

PHELPS, Michael         0.000706
LATYNINA, Larisa        0.000578
ANDRIANOV, Nikolay      0.000481
SHAKHLIN, Boris         0.000417
MANGIAROTTI, Edoardo    0.000417
Name: Athlete, dtype: float64